app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 7]]
---
<h2>Les derniers commentaires :</h2>
<% unless @article.comments.length > 0 %>