app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["title", "Article n°1"], ["body", "Je suis la description de l'article 1"], ["updated_at", "2022-10-30 14:29:22.193291"], ["status", "public"], ["id", 4]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)